environment variable :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Некоторые интересные переменные

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

DISPLAY
# Имя вашего дисплея, если вы работаете в графическом окружении. Обычно это :0, 
# что означает первый дисплей, сгенерированный X сервером

EDITOR
# Имя программы, используемой в качестве текстового редактора

SHELL
# Имя программы командной оболочки

HOME
# Путь к домашнему каталогу

LANG
# Определяет набор символов и порядок сортировки для вашего языка

OLD_PWD
# Предыдущий рабочий каталог

PAGER
# Имя программы для постраничного просмотра. Часто имеет значение /usr/bin/less

PATH
# Список каталогов, разделенных двоеточием, в которых производится поиск 
# выполняемых программ по их именам

PS1
# Строка приглашения к вводу No 1. Определяет содержимое строки приглашения к 
# вводу в командной оболочке. Как будет показано позднее, эту строку можно 
# менять весьма существенно

PWD
# Текущий рабочий каталог

TERM
# Тип терминала. Unix-подобные системы поддерживают множество протоколов для 
# работы с терминалами; эта переменная определяет протокол, который будет 
# использоваться при обмене данными с эмулятором терминала

TZ
# Определяет часовой пояс. В большинстве Unix-подобных систем внутренние часы 
# компьютера устанавливаются в координированное универсальное время 
# (Coordinated Universal Time, UTC), а при выводе значения времени к нему 
# добавляется смещение, определяемое этой переменной

USER
# Имя пользователя
