files ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# список полезных файлов

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

/boot/grub/grub.conf или menu.lst
# используются для настройки загрузчика

/boot/vmlinuz
# ядро Linux

/etc/crontab
# файл, определяющий время запуска автоматизированных заданий

/etc/fstab
# таблица устройств хранения и соответствующих им точек монтирования 

/etc/passwd
# список всех учетных записей пользователей

/dev/null
# Этот файл представляет системное устройство, называемое битоприемником 
# (bit bucket), или мусорной корзиной, которое принимает любой ввод и ничего 
# с ним не делает.

/etc/apt/sources.list
# sглавный список репозиториев

/etc/apt/sources.list.d
# каталог для сторонних репозиториев

/var/lib/dpkg/status
# список установленных пакетов

/var/lib/dpkg/available
# список доступных для скачивания пакетов