Команды для работы с историей ::::::::::::::::::::::::::::::::::::::::::::::::::

# перечислены некоторые комбинации клавиш, используемые для манипуляций со 
# списком истории команд

# ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

CTRL + P
# Переход к предыдущей записи в истории. Действует так же, как клавиша со 
# стрелкой вверх

CTRL + N
# Переход к следующей записи в истории. Действует так же, как клавиша со 
# стрелкой вниз

ALT + <
# Переход в начало (к первой записи) списка истории

ALT + >
# Переход в конец (к последней записи) списка истории

CTRL + R
# Инкрементальный поиск в обратном порядке. Поиск выполняется поступательно, 
# от текущей записи вверх по списку истории

ALT + P
# Поиск в обратном порядке, не инкрементальный. При использовании этого вида 
# поиска введите искомую строку и нажмите ENTER , и только после этого будет 
# выполнен фактический поиск

ALT + N
# Поиск в прямом порядке, не поступательный

CTRL + O
# Выполнить текущую команду в списке истории и перейти к следующей. Эту
# комбинацию удобно использовать, если требуется повторно выполнить 
# последовательность команд из списка истории
