Вырезание и вставка (удаление и возврат) текста :::::::::::::::::::::::::::

# перечислены комбинации клавиш, выполняющие вырезание и  вставку. 
# Вырезанные элементы сохраняются в  кольцевом буфере, который называется 
# kill-ring (кольцо удалений).

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

Команды редактирования текста

CTRL + D
# Удаляет символ в позиции курсора

CTRL + T
# Меняет местами два символа — в позиции курсора и предшествующий ему

ALT + T
# Меняет местами два слова — в позиции курсора и предшествующий ему

ALT + L
# Переводит в нижний регистр символы, начиная с символа в позиции курсора 
# и до конца слова

ALT + U
# Переводит в верхний регистр символы, начиная с символа в позиции курсора
# и до конца слова



Команды вырезания и вставки

CTRL + K
# Удаляет символы от позиции курсора до конца строки

CTRL + U
# Удаляет символы от позиции курсора до начала строки

ALT + D
# Удаляет символы от позиции курсора до конца текущего слова

ALT + BACKSPACE
# Удаляет символы от позиции курсора до начала текущего слова. Если курсор 
# находится в начале слова, удаляется предшествующее слово

CTRL + Y
# Извлекает текст из кольцевого буфера удалений и вставляет его в позицию 
# курсора
