Перемещение курсора :::::::::::::::::::::::::::::::::::::::::::::::::::::::

# перечислены комбинации клавиш, используемые для перемещения курсора.

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

CTRL + A
# Перемещает курсор в начало строки

CTRL + E
# Перемещает курсор в конец строки

CTRL + F
# Перемещает курсор на один символ вперед; действует так же, как клавиша 
# со стрелкой вправо

CTRL + B
# Перемещает курсор на один символ назад; действует так же, как клавиша со 
# стрелкой влево

ALT + F
# Перемещает курсор на одно слово вперед

ALT + B
# Перемещает курсор на одно слово назад

CTRL + L
# Очищает экран и устанавливает курсор в левый верхний угол. То же самое 
# делает команда clear

